code-review/NRB_3471_3546/База_Было/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>LEI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АнглийскоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИностраннаяОрганизация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВСтранеРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИМНС</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКОНХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКОПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКФС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИМНС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИнострОрганизации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКОПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКФС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПлательщикаПриПеречисленииНалогов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьШаблонаМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьШаблонаСД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерПФР</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерФСС</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоКодОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоНаименованиеОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПостоянногоМестонахождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Comment>Заполняется в случае, если организация не российская</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриториальныеУсловияПФР</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QI_SWIFT</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QI_EIN</Name>
					<Comment>Код в налоговой системе США</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TCCКод_IRSСША</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Лицензии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЛицензии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЛицензий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПрофессиональнойДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПрофессиональнойДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЛицензии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачиЛицензии</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияЛицензии</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганВыдавшийЛицензию</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСвидетельства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КемВыданаЛицензия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/ФормированиеПечатныхФорм/Ext/Module.bsl
// Возвращает структуру данных со сводным описанием контрагента
//
// Параметры: 
//  СписокСведений - список значений со значенийми параметров организации
//   СписокСведений формируется функцией СведенияОЮрФизЛице
//  Список         - список запрашиваемых параметров организаиии
//  СПрефиксом     - Признак выводить или нет префикс параметра организации
//
// Возвращаемое значение:
//  Строка - описатель организации / контрагента / физ.лица.
//
Функция ОписаниеОрганизации(СписокСведений, Список = "", СПрефиксом = Истина) Экспорт

	Если ПустаяСтрока(Список) Тогда
		Список = "ПолноеНаименование,ИНН,Свидетельство,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет";
	КонецЕсли; 

	Результат = "";

	СоответствиеПараметров = Новый Соответствие();
	СоответствиеПараметров.Вставить("ПолноеНаименование",		" ");
	СоответствиеПараметров.Вставить("ИНН",						" ИНН ");
	СоответствиеПараметров.Вставить("КПП",						" КПП ");
	СоответствиеПараметров.Вставить("Свидетельство",			" ");
	СоответствиеПараметров.Вставить("СвидетельствоДатаВыдачи",	" от ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес",			" ");
	СоответствиеПараметров.Вставить("Телефоны",					" тел.: ");
	СоответствиеПараметров.Вставить("НомерСчета",				" р/с ");
	СоответствиеПараметров.Вставить("Банк",               		" в банке ");
	СоответствиеПараметров.Вставить("БИК",                		" БИК ");
	СоответствиеПараметров.Вставить("КоррСчет",           		" к/с ");
	СоответствиеПараметров.Вставить("КодПоОКПО",          		" Код по ОКПО ");

	ЧислоПараметров = СтрЧислоВхождений(Список, ",");

	Для Счетчик = 1 по ЧислоПараметров Цикл

		ПозЗапятой = Найти(Список, ",");

		Если ПозЗапятой > 0  Тогда
			ИмяПараметра = Лев(Список, ПозЗапятой - 1);
			Список = Сред(Список, ПозЗапятой + 1, СтрДлина(Список));

			Попытка
				СтрокаДополнения = "";
				СписокСведений.Свойство(ИмяПараметра, СтрокаДополнения);

				Если ПустаяСтрока(СтрокаДополнения) Тогда
					Продолжить;
				КонецЕсли;

				Префикс = СоответствиеПараметров[ИмяПараметра];
				Если Не ПустаяСтрока(Результат)  Тогда
					Результат = Результат + ",";
				КонецЕсли; 

				Результат = Результат + ?(СПрефиксом = Истина, Префикс, "") + СтрокаДополнения;

			Исключение

				Сообщить("Не удалось определить значение параметра организации: " + ИмяПараметра, СтатусСообщения.Внимание);

			КонецПопытки;

		КонецЕсли; 

	КонецЦикла;

	Возврат Результат;

КонецФункции // ОписаниеОрганизации()

// Выводит на печать подготовленный макет 
//
// Параметры:
//  ПечДокумент            - ТабличыйДокумент, макет на печать,
//  КоличествоЭкземпляров  - Число, количество экземпляров на печать,
//  НаПринтер              - Булево, Если истина, то выводим сразу на принтер.
//  Заголовок              - Заголовок окна табличного документа
//  НепосредственнаяПечать - используется только для режи
Процедура НапечататьДокумент(ПечДокумент, КоличествоЭкземпляров = 1, НаПринтер = Ложь, Заголовок = "", НепосредственнаяПечать = Ложь) Экспорт

	Если ПечДокумент = Неопределено тогда
		Возврат;
	КонецЕсли;

	// Получить необходимое количество копий
	Если КоличествоЭкземпляров > 0 Тогда
		ПечДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;

	Если НЕ ПечДокумент.АвтоМасштаб
	   И ОбщегоНазначения.ЗначениеНеЗаполнено(ПечДокумент.ИмяПринтера) Тогда
		ПечДокумент.АвтоМасштаб = Истина;
	КонецЕсли;

	Если НаПринтер Тогда

		ПечДокумент.Напечатать(Истина);
		Если ПечДокумент.ИмяПринтера = "Bullzip PDF Printer" Тогда
		
			ПутьСкрипта = ПолучитьИмяВременногоФайла("vbs");
			СкриптФайл = Новый ТекстовыйДокумент;
			СкриптФайл.ДобавитьСтроку("WScript.Sleep("+Формат(3000, "ЧГ=0")+")");
			СкриптФайл.Записать(ПутьСкрипта, КодировкаТекста.OEM);
			WSHShell = Новый COMОбъект("WScript.Shell");
			WSHShell.Run("wscript.exe """+ПутьСкрипта+"""", 0, Истина);
			УдалитьФайлы(ПутьСкрипта);
			
		КонецЕсли;

	Иначе

		// Отобразить печатный документ на экране
		ПечДокумент.ОтображатьЗаголовки = Ложь;
		ПечДокумент.ОтображатьСетку     = Ложь;
		ПечДокумент.Защита              = Ложь;
		ПечДокумент.ТолькоПросмотр      = Истина;

		ПечДокумент.Показать(Заголовок);

	КонецЕсли;

КонецПроцедуры // НапечататьДокумент()

// Стандартная для данной конфигурации функция форматирования сумм
//
// Параметры: 
//  Сумма  - число, которое мы хотим форматировать, 
//  Валюта - ссылка на элемент справочника валют, если задан, то к в результирующую строку
//           будет добавлено представление валюты
//  ЧН     - строка, представляющая нулевое значение числа,
//  ЧРГ    - символ-разделитель групп целой части числа.
//
// Возвращаемое значение:
//  Отформатированная должным образом строковое представление суммы.
//
Функция ФорматСумм(Сумма, Валюта = Неопределено, ЧН = "", ЧРГ = "") Экспорт

	ФорматнаяСтрока = "ЧЦ=15;ЧДЦ=2" +
					?(ОбщегоНазначения.ЗначениеНеЗаполнено(ЧН), "", ";" + "ЧН=" + ЧН) +
					?(ОбщегоНазначения.ЗначениеНеЗаполнено(ЧРГ),"", ";" + "ЧРГ=" + ЧРГ);

	РезультирующаяСтрока = СокрЛ(Формат(Сумма, ФорматнаяСтрока));
	
	Если Не ОбщегоНазначения.ЗначениеНеЗаполнено(Валюта) Тогда
		РезультирующаяСтрока = РезультирующаяСтрока + " " + СокрП(Валюта);
	КонецЕсли;

	Возврат РезультирующаяСтрока;

КонецФункции // ФорматСумм()

// Стандартная функция форматирования прописи количества
//
// Параметры:
//  Количество - число, которое мы хотим форматировать
//
// Возвращаемое значение:
//  Отформатированная должным образом строковое представление количества.
//
Функция КоличествоПрописью(Количество) Экспорт

	ЦелаяЧасть   = Цел(Количество);
	ДробнаяЧасть = Окр(Количество - ЦелаяЧасть, 3);

	Если ДробнаяЧасть = Окр(ДробнаяЧасть,0) Тогда
		ПараметрыПрописи = ", , , , , , , , 0";

	ИначеЕсли ДробнаяЧасть = Окр(ДробнаяЧасть, 1) Тогда
		ПараметрыПрописи = "целая, целых, целых, ж, десятая, десятых, десятых, м, 1";

	ИначеЕсли ДробнаяЧасть = Окр(ДробнаяЧасть, 2) Тогда
		ПараметрыПрописи = "целая, целых, целых, ж, сотая, сотых, сотых, м, 2";

	Иначе
		ПараметрыПрописи = "целая, целых, целых, ж, тысячная, тысячных, тысячных, м, 3";

	КонецЕсли;

	Возврат ЧислоПрописью(Количество, ,ПараметрыПрописи);

КонецФункции // КоличествоПрописью()

// Процедура возвращает паспортные данные физлица в виде строки
//
// Параметры: 
//  ФизЛицо - ссылка на элемент справочника "Физические лица",по которму необходимо
//            получить паспортные данные.
//
// Возвращаемое значение:
//  Строка с данными об удостоверении личности физичского лица
//
Функция ПолучитьПаспорныеДанныеСтрокой(ФизЛицо) Экспорт

	СтруктураПаспортныхДанных = РегистрыСведений.ПаспортныеДанныеФизЛиц.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("ФизЛицо",ФизЛицо));

	ВидДокумента       = СтруктураПаспортныхДанных.ДокументВид;
	Серия              = СтруктураПаспортныхДанных.ДокументСерия;
	Номер              = СтруктураПаспортныхДанных.ДокументНомер;
	ДатаВыдачи         = СтруктураПаспортныхДанных.ДокументДатаВыдачи;
	КемВыдан           = СтруктураПаспортныхДанных.ДокументКемВыдан;
	НомерПодразделения = СтруктураПаспортныхДанных.ДокументКодПодразделения;

	Если НЕ (Не ЗначениеЗаполнено(ДатаВыдачи)
		   И Не ЗначениеЗаполнено(ВидДокумента)
		   И Не ЗначениеЗаполнено(Серия)
		   И Не ЗначениеЗаполнено(Номер)
		   И Не ЗначениеЗаполнено(КемВыдан)
		   И Не ЗначениеЗаполнено(НомерПодразделения)) Тогда

		Возврат ?(ВидДокумента.Пустая(),"","" + ВидДокумента + ", ") 
				+ "Серия: "   + Серия + ", № " + Номер 
				+ ", Выдан: " + Формат(ДатаВыдачи,"ДФ='дд ММММ гггг'") + " года, " 
				+ КемВыдан    + "; № подр. " + НомерПодразделения;

	Иначе

		Возврат "Отсутствуют данные об удостоверении личности."

	КонецЕсли;

КонецФункции
  
// Функция получения данных о депозитарной лицензии организации в ввиде структуры.
//
// Параметры
//  Организация  – СправочникССылка.Организация. 
//                
// Возвращаемое значение:
//   Структура   – Данные о депозитарной лицензии.
//
Функция ДанныеЛицензииОрганизации(Организация) Экспорт
	
	ДепозитарнаяЛицензия = Новый Структура("НомерЛицензии,ДатаЛицензии,ОрганВыдавшийЛицензию");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОрганизацииЛицензии.НомерЛицензии КАК НомерЛицензии,
	|	ОрганизацииЛицензии.ДатаВыдачиЛицензии КАК ДатаВыдачиЛицензии,
	|	ОрганизацииЛицензии.ОрганВыдавшийЛицензию КАК ОрганВыдавшийЛицензию
	|ИЗ
	|	Справочник.Организации.Лицензии КАК ОрганизацииЛицензии
	|ГДЕ
	|	ОрганизацииЛицензии.Ссылка = &Ссылка
	|	И ОрганизацииЛицензии.ТипЛицензии = &ТипЛицензии";
	
	Запрос.УстановитьПараметр("Ссылка", Организация);
	Запрос.УстановитьПараметр("ТипЛицензии", Справочники.ВидыЛицензий.ДепозитарнаяДеятельность);
		
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда 	
		ДепозитарнаяЛицензия.НомерЛицензии			= Выборка.НомерЛицензии;
		ДепозитарнаяЛицензия.ДатаЛицензии			= Формат(Выборка.ДатаВыдачиЛицензии,"ДФ=dd.MM.yyyy; ДП=-");
		ДепозитарнаяЛицензия.ОрганВыдавшийЛицензию	= Выборка.ОрганВыдавшийЛицензию;
  	КонецЕсли;
  
	Если НЕ ЗначениеЗаполнено(ДепозитарнаяЛицензия.НомерЛицензии) Тогда
		ДепозитарнаяЛицензия.НомерЛицензии = "<Нет данных о номере лицензии>";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДепозитарнаяЛицензия.ДатаЛицензии) Тогда
		ДепозитарнаяЛицензия.ДатаЛицензии = "<Нет данных о дате лицензии>";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДепозитарнаяЛицензия.ОрганВыдавшийЛицензию) Тогда
		ДепозитарнаяЛицензия.ОрганВыдавшийЛицензию = "<Нет данных об органе, выдавшем лицензию>";
	КонецЕсли;
	
	Возврат ДепозитарнаяЛицензия;
   
КонецФункции

Функция ИнформацияОДепозитарии(ДатаОтчета, ВидСчетаДепо) Экспорт
	Инфо =
	"ДЕПОЗИТАРИЙ
	|%1
	|Лицензия № %2 выдана %3 г. %4
	|%5
	|%6";
	
	Депозитарий		= Константы.ОрганизацияПоУмолчанию.Получить();
	ДанныеЛицензии	= ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);	
	Инфо = СтрЗаменить(Инфо, "%1", СокрЛП(Депозитарий.НаименованиеПолное));
	Инфо = СтрЗаменить(Инфо, "%2", СокрЛП(ДанныеЛицензии.НомерЛицензии));
	Инфо = СтрЗаменить(Инфо, "%3", ДанныеЛицензии.ДатаЛицензии);
	Инфо = СтрЗаменить(Инфо, "%4", ДанныеЛицензии.ОрганВыдавшийЛицензию);
	Инфо = СтрЗаменить(Инфо, "%5", КонтактнаяИнформация.ПолучитьАдресИзКонтактнойИнформацииНаДату(Депозитарий, "Юридический", ДатаОтчета));
	Инфо = СтрЗаменить(Инфо, "%6", КонтактнаяИнформация.ПолучитьТелефонИзКонтактнойИнформацииНаДату(Депозитарий, ДатаОтчета));
	
	Возврат Инфо;
КонецФункции

Функция ИнформацияОДепозитарииНаАнглийском(ДатаОтчета, ВидСчетаДепо) Экспорт
	Инфо =
	"CUSTODY of %1
	|License No. %2 issued by FFMS of Russia on %3
	|%5
	|%4";
	Депозитарий		= Константы.ОрганизацияПоУмолчанию.Получить();
	ДанныеЛицензии	= ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);	
	Инфо = СтрЗаменить(Инфо, "%1", СокрЛП(Депозитарий.АнглийскоеНаименование));
	Инфо = СтрЗаменить(Инфо, "%2", СокрЛП(ДанныеЛицензии.НомерЛицензии));
	Инфо = СтрЗаменить(Инфо, "%3", ДанныеЛицензии.ДатаЛицензии);
	Инфо = СтрЗаменить(Инфо, "%4", КонтактнаяИнформация.ПолучитьТелефонИзКонтактнойИнформацииНаДату(Депозитарий, ДатаОтчета));
	Инфо = СтрЗаменить(Инфо, "%5", КонтактнаяИнформация.ПолучитьАдресИзКонтактнойИнформацииНаДату(Депозитарий, "Юридический", ДатаОтчета, "Eng"));
	
	Возврат Инфо;
КонецФункции

//////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ЗАПОЛНЕНИЯ ЗАГОЛОВКОВ ОТЧЕТОВ ПО ВИДУ СЧЕТА ДЕПО

// Читает XML-строку с текстами заголовков.
// Возвращает таблицу значений, содержащую тексты заголовков для вариантов ЦБ и ИФИ.
//
// Для добавления текстов заголовков в макетах:
// 1. В макете для печати заменить текст заголовка на имя параметра.
// Например, "Уполномоченное лицо Депозитария" заменить на "УполномоченноеЛицоДепозитария";
// 2. В XML-макет отчета "Заголовки" добавить узлы со значениями для подстановки в параметр.
//
// Параметры:
//	ОписаниеЗаголовковXML - строка с текстом XML
Функция ТекстыЗаголовковОтчетов(ОписаниеЗаголовковXML) Экспорт
	Тексты = Новый ТаблицаЗначений;
	Тексты.Колонки.Добавить("ИмяМакета");
	Тексты.Колонки.Добавить("ИмяСекции");
	Тексты.Колонки.Добавить("ИмяПараметра");
	Тексты.Колонки.Добавить("ЗаголовокЦБ");
	Тексты.Колонки.Добавить("ЗаголовокИФИ");
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ОписаниеЗаголовковXML);
	Построитель = Новый ПостроительDOM;
	Документ = Построитель.Прочитать(ЧтениеXML);
	Для Каждого Элемент0 Из Документ.ЭлементДокумента.ДочерниеУзлы Цикл
		Если Элемент0.ИмяУзла = "Макет" Тогда
			Макет = Элемент0;
			ИмяМакета = Макет.Атрибуты.ПолучитьИменованныйЭлемент("Имя");
			
			Для Каждого Элемент1 Из Макет.ДочерниеУзлы Цикл
				Если Элемент1.ИмяУзла = "Секция" Тогда
					Секция = Элемент1;
					ИмяСекции = Секция.Атрибуты.ПолучитьИменованныйЭлемент("Имя");
					
					Для Каждого Элемент2 Из Секция.ДочерниеУзлы Цикл
						Если Элемент2.ИмяУзла = "Параметр" Тогда
							Параметр = Элемент2;
							ИмяПараметра = Параметр.Атрибуты.ПолучитьИменованныйЭлемент("Имя");
							
							Строка = Тексты.Добавить();
							Строка.ИмяМакета	= СокрЛП(ИмяМакета.Значение);
							Строка.ИмяСекции	= СокрЛП(ИмяСекции.Значение);
							Строка.ИмяПараметра	= СокрЛП(ИмяПараметра.Значение);
							Строка.ЗаголовокЦБ	= "";
							Строка.ЗаголовокИФИ	= "";
							
							Для Каждого Элемент3 Из Параметр.ДочерниеУзлы Цикл
								Если Элемент3.ИмяУзла = "ЦБ" Тогда
									Строка.ЗаголовокЦБ = СокрЛП(Элемент3.ТекстовоеСодержимое);
								ИначеЕсли Элемент3.ИмяУзла = "ИФИ" Тогда
									Строка.ЗаголовокИФИ = СокрЛП(Элемент3.ТекстовоеСодержимое);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Тексты;
КонецФункции

// Из таблицы выбираются строки с указанным макетом и секцией, в параметры области устанавливаются значения
// заголовков, соответствующих виду счета депо.
//
// Параметры:
//	ПараметрыОбласти - параметры области табличного документа, которая заполняется.
//	ИмяМакета и ИмяСекции - макет и секция указанной области.
//	ТекстыЗаголовков - таблица, из которой берутся имена параметров и их значения (заголовки).
//	ВидСчетаДепо - по нему определяется, какой заголовок брать из таблицы (для счета ДЕПО - ЦБ, для счета НФИ - ИФИ).
Процедура УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции, ТекстыЗаголовков, ВидСчетаДепо) Экспорт
	Перем Отбор, Строки, Строка;
	
	Отбор = Новый Структура("ИмяМакета, ИмяСекции", ИмяМакета, ИмяСекции);
	Строки = ТекстыЗаголовков.НайтиСтроки(Отбор);
	Для Каждого Строка из Строки Цикл
		ПараметрыОбласти[Строка.ИмяПараметра] = Строка.ЗаголовокЦБ;
	КонецЦикла;
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////
//Печать договоров депонентов
//

//Функция проверяет заполненность ревизита шаблона и существование этого шаблона.
//
// Параметы:
//    ИмяФайла - строка, путь у шаблону печати.
//
//    НомерДоговора - строка, номер договора печати.
//
// Возвращаемое значение:
//    Истина.Булево - если проверка не проходит, иначе Ложь.
//
Функция ПроверкаШаблонаПечати(ИмяФайла,НомерДоговора) Экспорт
	
	//проверка на наличие указанного пути шаблона договора
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
		Сообщить("Установите файл шаблона!");
		Возврат Истина;
	КонецЕсли;
	
	//проверка на существование договора.
    ВыбИмяФайла = Новый Файл(ИмяФайла);
    Если Не ВыбИмяФайла.Существует() Тогда  
        Сообщить("Не правильно указан путь к шаблону печати договора!!!");
        ИмяФайла = "";
		Возврат Истина;
	КонецЕсли;
	
	//проверка на наличие номера договора
	Если Не ЗначениеЗаполнено(НомерДоговора) Тогда
		Сообщить("Установите номер договора");
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

 // Функция получения данных о депозитарной лицензии контрагента в ввиде структуры.
//
// Параметры
//  Контрагент  – СправочникССылка.Контрагент. 
//                
// Возвращаемое значение:
//   Структура   – Данные о депозитарной лицензии.
//
Функция ДепозитарнаяЛицензияЮрика(Контрагент) Экспорт
	
	ДепозитарнаяЛицензия = Новый Структура("НомерЛицензии,ДатаЛицензии,ОрганВыдачи");
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	КонтрагентыЛицензии.НомерЛицензии,
	|	КонтрагентыЛицензии.ДатаВыдачиЛицензии КАК ДатаВыдачиЛицензии,
	|	КонтрагентыЛицензии.ОрганВыдавшийЛицензию
	|ИЗ
	|	Справочник.Контрагенты.Лицензии КАК КонтрагентыЛицензии
	|ГДЕ
	|	КонтрагентыЛицензии.Ссылка = &Ссылка
	|	И КонтрагентыЛицензии.ТипЛицензии = &ТипЛицензии
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыдачиЛицензии";
	
	Запрос.УстановитьПараметр("Ссылка",Контрагент );
	Запрос.УстановитьПараметр("ТипЛицензии",Справочники.ВидыЛицензий.БрокерскаяДеятельность);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл 	
		
	  ДепозитарнаяЛицензия.НомерЛицензии  =   Выборка.НомерЛицензии;
	  ДепозитарнаяЛицензия.ДатаЛицензии   =   Формат(Выборка.ДатаВыдачиЛицензии,"ДФ=dd.MM.yyyy; ДП=-");
	  ДепозитарнаяЛицензия.ОрганВыдачи    =	  Выборка.ОрганВыдавшийЛицензию
	  
	КонецЦикла;
	
	Если ДепозитарнаяЛицензия.НомерЛицензии = Неопределено Тогда
	    ДепозитарнаяЛицензия.НомерЛицензии = "Нет данных о номере лицензии";	
	КонецЕсли; 
	
	Если ДепозитарнаяЛицензия.ДатаЛицензии = Неопределено Тогда
	    ДепозитарнаяЛицензия.ДатаЛицензии = "Нет данных о дате лицензии";	
	КонецЕсли; 
    	
   Возврат ДепозитарнаяЛицензия
   
КонецФункции // ДанныеЛицензииОрганизации()


/////////////////////////////////////////////////////////////////////////////////////
//ФУНКЦИИ И ПРОЦЕДУРЫ ПРОВЕРКИ И ПЕЧАТИ АНКЕТЫ ДЕПОНЕНТА И ПРЕДСТАВИТЕЛЯ СЧЕТА ДЕПО.

// Функция проверяет на наличие представителя счета депо 
//                       на текущую дату.
// Параметры
//  СчетДепо  - СправочникСсылка.СчетДепо.
//    
// Возвращаемое значение:
//		Булево.Истина - если представитель есть и имеет статус назначен.   
//
Функция ПроверкаНаНаличиеПредставителяСчетаДепо(СчетДепо,ВидПредставителяСчетаДепо)  Экспорт

	СтруктураПредставителя	=	РегистрыСведений.ПредставителиСчетаДепо.ПолучитьПоследнее(ТекущаяДата(),	
            Новый Структура("СчетДепо,ВидПредставителя",СчетДепо,ВидПредставителяСчетаДепо));
			                            
	Если НЕ СтруктураПредставителя.Представитель.Пустая()  Тогда		
			
		Если СтруктураПредставителя.СтатусПредставителя = Перечисления.СтатусыПредставителей.Назначен Тогда
			
			Если ТекущаяДата() > СтруктураПредставителя.ДатаОкончанияДействияДоверенности  Тогда
			    			
			    Сообщить("Срок действия доверенности истек "+СтруктураПредставителя.ДатаОкончанияДействияДоверенности );
				
			КонецЕсли; 
			
			Результат	=	Истина;
			
		Иначе
			Сообщить("Представитель счета депо №" + СчетДепо.Код + " " + СтруктураПредставителя.Представитель
			        + " имеет статус отменен.");
			Результат	=	Ложь;
			
		КонецЕсли;	
		
	Иначе
		
		Сообщить(Строка(ВидПредставителяСчетаДепо) +" счета депо не назначен!");
		Результат	=	Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПроверкаНаНаличиеПредставителяСчетаДепо(СчетДепо)
 
// Функция возвращает структуру представителя счета депо 
//                       на текущую дату.
// Параметры
//  СчетДепо  - СправочникСсылка.СчетДепо.
//    
// Возвращаемое значение:
//		Структура.РегистраСведенийПредставителиСчетаДепо. 
//
Функция ПредставительСчетаДепо(СчетДепо,ВидПредставителяСчетаДепо)  Экспорт

	СтруктураПредставителя = РегистрыСведений.ПредставителиСчетаДепо.ПолучитьПоследнее(ТекущаяДата(),	
            Новый Структура("СчетДепо,ВидПредставителя",СчетДепо,ВидПредставителяСчетаДепо));
			
	Возврат СтруктураПредставителя;
	
КонецФункции // ПроверкаНаНаличиеПредставителяСчетаДепо(СчетДепо)

///////////////////////////////////////////////////////////////////////////////////////////
//ФУНКЦИИ И ПРОЦЕДУРЫ ОБРАБОТКИ ИНФОРМАЦИИ О ЦБ.

Процедура УстановитьПараметрМакетаПосимвольно(Параметры, ИмяПараметра, ЧислоСимволов, ЗначениеПараметра) Экспорт

	Для сч=1 По ЧислоСимволов Цикл
		Параметры[ИмяПараметра+Строка(Сч)] = Сред(ЗначениеПараметра, Сч, 1);
	КонецЦикла; 

КонецПроцедуры

Процедура СформироватьДатуДДММММГГ(пПараметры, ПрефиксИмени, Дата) Экспорт

	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	ДеньСтрокой = Формат(День(Дата), "ЧЦ=2; ЧВН=");
	ГодСтрокой = Прав(Формат(Год(Дата), "ЧЦ=4; ЧВН=; ЧГ=0"), 2);
	
	Если ТипЗнч(пПараметры) = Тип("Структура") Тогда
		стПараметры = пПараметры;
	Иначе
		стПараметры = Новый Структура;
	КонецЕсли;
	
	стПараметры.Вставить(ПрефиксИмени + "День1", Лев(ДеньСтрокой, 1));
	стПараметры.Вставить(ПрефиксИмени + "День2", Прав(ДеньСтрокой, 1));

	стПараметры.Вставить(ПрефиксИмени + "Месяц", СтрЗаменить(Формат(НачалоМесяца(Дата), "ДФ='дд ММММ'"), "01 ", ""));

	стПараметры.Вставить(ПрефиксИмени + "Год1", Лев(ГодСтрокой, 1));
	стПараметры.Вставить(ПрефиксИмени + "Год2", Прав(ГодСтрокой, 1));
	
	Если ТипЗнч(пПараметры) = Тип("ПараметрыМакетаТабличногоДокумента") Тогда
		пПараметры.Заполнить(стПараметры);
	Иначе
		пПараметры = стПараметры;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДатуДДММГГ(пПараметры, ПрефиксИмени, Дата) Экспорт

	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСтрокой = Формат(Дата, "ДФ=ddMMyyyy");
	
	Если ТипЗнч(пПараметры) = Тип("Структура") Тогда
		стПараметры = пПараметры;
	Иначе
		стПараметры = Новый Структура;
	КонецЕсли;
	
	стПараметры.Вставить(ПрефиксИмени + "День1",	Сред(ДатаСтрокой, 1, 1));
	стПараметры.Вставить(ПрефиксИмени + "День2",	Сред(ДатаСтрокой, 2, 1));
	стПараметры.Вставить(ПрефиксИмени + "Месяц1",	Сред(ДатаСтрокой, 3, 1));
	стПараметры.Вставить(ПрефиксИмени + "Месяц2",	Сред(ДатаСтрокой, 4, 1));
	стПараметры.Вставить(ПрефиксИмени + "Год1",		Сред(ДатаСтрокой, 7, 1));
	стПараметры.Вставить(ПрефиксИмени + "Год2",		Сред(ДатаСтрокой, 8, 1));
	
	Если ТипЗнч(пПараметры) = Тип("ПараметрыМакетаТабличногоДокумента") Тогда
		пПараметры.Заполнить(стПараметры);
	Иначе
		пПараметры = стПараметры;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДатуВремяДДММГГЧЧММ(пПараметры, ПрефиксИмени, Дата) Экспорт
	СформироватьДатуДДММГГ(пПараметры, ПрефиксИмени, Дата);
	
	ДатаСтрокой = Формат(Дата, "ДФ=HHmm");
	
	Если ТипЗнч(пПараметры) = Тип("Структура") Тогда
		стПараметры = пПараметры;
	Иначе
		стПараметры = Новый Структура;
	КонецЕсли;

	стПараметры.Вставить(ПрефиксИмени + "Час1",		Сред(ДатаСтрокой, 1, 1));
	стПараметры.Вставить(ПрефиксИмени + "Час2",		Сред(ДатаСтрокой, 2, 1));
	стПараметры.Вставить(ПрефиксИмени + "Минута1",	Сред(ДатаСтрокой, 3, 1));
	стПараметры.Вставить(ПрефиксИмени + "Минута2",	Сред(ДатаСтрокой, 4, 1));
	
	Если ТипЗнч(пПараметры) = Тип("ПараметрыМакетаТабличногоДокумента") Тогда
		пПараметры.Заполнить(стПараметры);
	Иначе
		пПараметры = стПараметры;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет параметры макета посимвольно
// 
Процедура ЗаполнитьПараметрыДатыПечатнойФормы(ПараметрыМакета, Дата) Экспорт
	
	ДеньСтрокой = Формат(День(Дата), "ЧЦ=2; ЧН=; ЧВН=");
	МесяцСтрокой = Формат(Месяц(Дата), "ЧЦ=2; ЧН=; ЧВН=");
	ГодСтрокой = Прав(Формат(Год(Дата), "ЧЦ=4; ЧН=; ЧВН=; ЧГ=0"),2);
	
	ПараметрыМакета.День1 = Лев(ДеньСтрокой,1);
	ПараметрыМакета.День2 = Прав(ДеньСтрокой,1);
	
	ПараметрыМакета.Месяц1 = Лев(МесяцСтрокой,1);
	ПараметрыМакета.Месяц2 = Прав(МесяцСтрокой,1);
	
	ПараметрыМакета.Год1 = Лев(ГодСтрокой,1);
	ПараметрыМакета.Год2 = Прав(ГодСтрокой,1);
	
КонецПроцедуры

Процедура ПоказатьТабличныйДокумент(ТабДок) Экспорт
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();
	
КонецПроцедуры

// Получение картинки факсимилье
Процедура ПолучитьФаксимилье(ФизическоеЛицо, ТочкаВставки) Экспорт
	// Если нет физ. лица, то и получать нечего (возвращаем пустую картинку)
	Если ФизическоеЛицо = Неопределено Тогда
		ТочкаВставки = Новый Картинка;
		Возврат;
	КонецЕсли;
	// Находим факсимилье в справочнике файлов
	ЗапросФаксимилье	= Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.Файлы ГДЕ НЕ ПометкаУдаления И Объект = &Объект И ДополнительныйПризнакФайла = ЗНАЧЕНИЕ(Перечисление.ДополнительныеПризнакиФайлов.Факсимилье)");
	ЗапросФаксимилье.УстановитьПараметр("Объект", ФизическоеЛицо);
	
	Результат	= ЗапросФаксимилье.Выполнить().Выгрузить();
	
	Если Результат.Количество()>0 Тогда
		СсылкаФайл	= Результат[0].Ссылка;
		// Сформируем картинку
		ТочкаВставки = Новый Картинка(СсылкаФайл.Данные.Получить(), Истина);
		Возврат;
	Иначе
		ТочкаВставки = Новый Картинка;
		Возврат;
	КонецЕсли;	
КонецПроцедуры

// Проверяет, умещаются ли переданные табличные документы на страницу при печати.
//
// Параметры:
//  ТабДокумент			 - ТабличныйДокумент - Табличный документ
//  ВыводимыеОбласти	 - Массив			 - Массив из проверяемых таблиц или табличный документ
//  РезультатПриОшибке	 - Булево			 - Какой возвращать результат при возникновении ошибки
// 
// Возвращаемое значение:
//  Булево - умещаются или нет переданные документы
//
Функция ПроверитьВыводТабличногоДокумента(ТабДокумент, ВыводимыеОбласти, РезультатПриОшибке = Истина) Экспорт
	
	Попытка
		Возврат ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
	Исключение
		Возврат РезультатПриОшибке;
	КонецПопытки;
	
КонецФункции // ПроверитьВыводТабличногоДокумента()

// Процедура - Вывести горизонтальный разделитель
//
// Параметры:
//  ТабличныйДокумент			 - ТабличныйДокумент - Табличный документ куда выводятся области
//  ОбластиКПечатиНаОдномЛисте	 - Массив			 - Массив областей макета к печати на одном листе
//
Процедура ВывестиГоризонтальныйРазделитель(ТабличныйДокумент, ОбластиКПечатиНаОдномЛисте) Экспорт
	Если Не ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ОбластиКПечатиНаОдномЛисте) Тогда
		// Если проверяемые области не помещаются на один лист - начать их вывод с нового листа
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
КонецПроцедуры
